app/views/breweries/show.html.erb

  Number of beers:
  <%= @brewery.beers.count %>
---
SELECT "beers".* FROM "beers" WHERE "beers"."brewery_id" = 1
SELECT COUNT(*) FROM "beers" WHERE "beers"."brewery_id" = 1