app/controllers/beers_controller.rb

SELECT "beers".* FROM "beers"
---
  def index
    @beers = Beer.all.sort_by{ |b| b.send(params[:order] || 'name') }

SELECT "beers".* FROM "beers" WHERE "beers"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @beer = Beer.find(params[:id])