app/controllers/breweries_controller.rb

  def index
    @breweries = Brewery.all
---
SELECT "breweries".* FROM "breweries"

  def show
    @brewery = Brewery.find(params[:id])
---
SELECT "breweries".* FROM "breweries" WHERE "breweries"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @brewery = Brewery.new(params[:brewery])

    respond_to do |format|
      if @brewery.save
---
INSERT INTO "breweries" ("created_at", "name", "updated_at", "year") VALUES (?, ?, ?, ?)  [["created_at", Wed, 20 Nov 2013 19:02:07 UTC +00:00], ["name", "Keijon Kotipanimo"], ["updated_at", Wed, 20 Nov 2013 19:02:07 UTC +00:00], ["year", 2011]]